using System;
using System.Text.RegularExpressions;
using System.Collections.Generic;
using lib;

namespace crypto_analiz
{
    class Program
    {
        

        static void Main(string[] args)
        {
            Console.WriteLine("Hello World!");
            string text = "ЧЮТНЧЦЯЫДФЕЖУШКЬДХОРНЮУНКНЬШЗИЮЮХПФЦДЯРРРЦНХЧЮЕУННХЮОХУЪСЯЕЩКЬЯЪИУАФДЬЕНЕМХМШЛИСДББЯЕШОЭТЯИЧДАБКОЬАСЕЬРНСЕШРОПХРХЪИЧПХХССЮДЫОСЖТПРДРННЦМШКИЮНЪОХЕЮФЛМСИНФБОУЛТФШЦЪВФГБАСЛХХЮЕЩЕЩЯЮШАКХСЭУХНХЫХИЦНТЖШКИЛЩДФТСМЩКСАУОЩНЖЛМОЯЛХПШОШКЬЛКАПЯАУТОРТЬЛКАЩКПЦХОРТЬУЛСТЦРПСНТНЧСОРХРЭЗГСЪОЭИЦСЮНДУЧОЧМВЮСМХУЭТОМЭКЯАФИЪЕЪЕТАШНЩЕТТХЩЭЦЧОЦТШТЦИЮТЯМОСЮЖХТХОЭТТЦОМЩКБЕТКНОПЖОЖНПЮУНУШДЪПХЯФАРТНРТНЬЛЪАЦОРПФЫОКЦЕУИЦФШЬИЛХНФХИЛХХМЦЦВЭКЫТОТНОЩЕТСЪМЪУКЛТСЬАФИХНАФЫГНСЬАФИЧНЕЕФИЮДИОУИСФВИЫДЬЧУЕКАЩСШПЬРНСЕШРИНФБОУЛТФШЦЪСЪЖАЛФНТЦРПЧОЧМВЧЦБЧДЩЕЧОКЦЭСЫВЗХЭПЦМЯЕХЦТОЩКЖТЦМЯСХЖЫКНОЦЛЗНТЖШКИЛЫФХМНЕКЦЭИЦВЗХЭПЦГЪСХЖИИЦДЩДЩЧНХБРСВГЦЭШРННПХИЦННОЭТОЦСДТЦОПЯХБУОВЭКЭЖФАЩОЯУФЕКЦЭИЦБТХЩУХЕГСЭИЦНТЕРТСЧТЗЭТСЧТЗЭТОТЦФЭСОЕРТЬУСТЪЗЭКИЖТСХЧХИГКУУХЕЮОЯУФЕЮНЗОХЫЯХЮУТОТСШДССЧДТЕКОРЧ";

            text = text.ToLower();
            List<grams> finded = new List<grams>();
            find_grams(text, ref finded);
        }
    }
}
