using System;
using System.Text.RegularExpressions;
using System.Collections.Generic;
using lib;
using table_viginer;

namespace crypto_analiz
{
    class Program
    {
        

        static void Main(string[] args)
        {
            Console.WriteLine("Hello World!");
            string text = "ЧЮТНЧЦЯЫДФЕЖУШКЬДХОРНЮУНКНЬШЗИЮЮХПФЦДЯРРРЦНХЧЮЕУННХЮОХУЪСЯЕЩКЬЯЪИУАФДЬЕНЕМХМШЛИСДББЯЕШОЭТЯИЧДАБКОЬАСЕЬРНСЕШРОПХРХЪИЧПХХССЮДЫОСЖТПРДРННЦМШКИЮНЪОХЕЮФЛМСИНФБОУЛТФШЦЪВФГБАСЛХХЮЕЩЕЩЯЮШАКХСЭУХНХЫХИЦНТЖШКИЛЩДФТСМЩКСАУОЩНЖЛМОЯЛХПШОШКЬЛКАПЯАУТОРТЬЛКАЩКПЦХОРТЬУЛСТЦРПСНТНЧСОРХРЭЗГСЪОЭИЦСЮНДУЧОЧМВЮСМХУЭТОМЭКЯАФИЪЕЪЕТАШНЩЕТТХЩЭЦЧОЦТШТЦИЮТЯМОСЮЖХТХОЭТТЦОМЩКБЕТКНОПЖОЖНПЮУНУШДЪПХЯФАРТНРТНЬЛЪАЦОРПФЫОКЦЕУИЦФШЬИЛХНФХИЛХХМЦЦВЭКЫТОТНОЩЕТСЪМЪУКЛТСЬАФИХНАФЫГНСЬАФИЧНЕЕФИЮДИОУИСФВИЫДЬЧУЕКАЩСШПЬРНСЕШРИНФБОУЛТФШЦЪСЪЖАЛФНТЦРПЧОЧМВЧЦБЧДЩЕЧОКЦЭСЫВЗХЭПЦМЯЕХЦТОЩКЖТЦМЯСХЖЫКНОЦЛЗНТЖШКИЛЫФХМНЕКЦЭИЦВЗХЭПЦГЪСХЖИИЦДЩДЩЧНХБРСВГЦЭШРННПХИЦННОЭТОЦСДТЦОПЯХБУОВЭКЭЖФАЩОЯУФЕКЦЭИЦБТХЩУХЕГСЭИЦНТЕРТСЧТЗЭТСЧТЗЭТОТЦФЭСОЕРТЬУСТЪЗЭКИЖТСХЧХИГКУУХЕЮОЯУФЕЮНЗОХЫЯХЮУТОТСШДССЧДТЕКОРЧ";

            Class1 obj = new Class1(text);
            //table_v obj2 = new table_v("абвгдежзийклмнопрстуфхцчшщъыьэюя");
            //char c = obj2.decrypt_word('н', 'о');

            obj.decrypt();
            
        }
    }
}
